Lesson-3.org
* VLANs (Week 2)
Are created at the Layer 2 to reduce or eliminate broadcast
traffic. VLANs are how you break up your network into smaller networks
so that the devices and people within a single VLAN are communicating
with each other and not having tof manage traffic from other networks.jj

** Overview of VLANs
*** VLAN Definitions
Provide segmentation and organizational flexibility in a switched
network. A group of devices withina VLAN communicates as if each
device was attached to the same cable. VLANs are based on *logical*
connections instead of physical connections


A VLAN creates a logical broadcast domain that can span multiple
physical LAN segments. VLANs improve network performance by separating
large broadcast domains into smaller ones. If a device in one VLAN
sends a broadcast Ethernet frame, all devices in the VLAN receive the
frame, but devices in other VLANs do not.
*** Benefits of a VLAN Design
Each VLAN in a switched netword corresponds to an IP
network. Therefore, VLAN design must take into consideration the
implementation of hiearchical network addressing scheme. *Hierarchical
network addressing* means that IP network numbers are applied to
network segments or VLANs in a way that takes the network as a whole
into consideration.

| Benefit                                    | Description                                                                                                                                                                               |
|--------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Smaller broadcast domains                  | dividing a network into VLANs reduces the number of devices in the broadcase domain                                                                                                       |
|                                            |                                                                                                                                                                                           |
| Improved security                          | only used in the same vlan can communicate together                                                                                                                                       |
|                                            | access control lists can be provided to restrict the traffic between VLANs                                                                                                                |
|                                            |                                                                                                                                                                                           |
| Improved IT efficiency                     | VLANs simplify network management because users with similar network requirements can be configured on the same VLAN                                                                      |
|                                            | VLANs can be named                                                                                                                                                                        |
|                                            |                                                                                                                                                                                           |
| Reduced cost                               | reduces the cost for expensive network upgrades                                                                                                                                           |
|                                            |                                                                                                                                                                                           |
| better performance                         | smaller broadcast domains reduce unnecessary traffic on the network and improve performance                                                                                               |
|                                            |                                                                                                                                                                                           |
| simpler project and application management | VLANs aggregate users and network devices to support business or geographic requirements                                                                                                  |
|                                            | having seperate functions makes managing a project or working with a specialized application easire; an example of such an application is an e-learning development platform for faculty] |

*** Types of VLANs
**** Default VLAN
is the VLAN 1 on a cisco switch.


/NOTE/: All port are assigned to VLAN 1 by default. The native VLAN and
management VLAN is VLAN 1. Also, VLAN 1 cannot be renamed or deleted.


The command ~show vlan brief~ outputs the vlans on a switch and the
ports assigned to them.
**** Data VLAN
are VLANs configured to seperate user-generated traffic. Referred to
as *user VLANs* because they seperate the network into groups of users
or devices.

/NOTE/: voice and netowrk management traffic should not be permitted
on data VLANs

**** Native VLAN
User traffic from a  VLAN must be tagged with its VLAN ID when it is
sent to another switch. Trunk ports are used between switches to
support the transmission of tagged traffic. Specifically, an *802.1Q*
trunk port inserts a 5 byte tag in the ethernet frame header to
identify the VLAN to which the frame belongs

Where untagged frames are assigned to

**** Management VLAN
is a data VLAN configured specificalled for network management
traffic, including secure shell (ssh), telnet, HTTPS, HTTP, and
SNMP. By default, VLAN 1 is configured as the management VLAN.



