Lesson-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-10 Mon 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Emmanuel Parreno" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org57c8aed">1. VLANs (Week 2)</a>
<ul>
<li><a href="#org84d8656">1.1. Overview of VLANs</a>
<ul>
<li><a href="#orge6bc627">1.1.1. VLAN Definitions</a></li>
<li><a href="#orgf60c264">1.1.2. Benefits of a VLAN Design</a></li>
<li><a href="#org88139b3">1.1.3. Types of VLANs</a></li>
</ul>
</li>
<li><a href="#orgb5d40c2">1.2. VLANs in a Multi-switched Environment</a>
<ul>
<li><a href="#org8b5b274">1.2.1. Defining VLAN Trunks</a></li>
<li><a href="#orgd2f62b8">1.2.2. Network Without VLANs</a></li>
<li><a href="#org4f11e31">1.2.3. Network with VLANs</a></li>
<li><a href="#orgc1eee00">1.2.4. Vlan Identification with a Tag</a></li>
<li><a href="#orge440074">1.2.5. Native VLANs and 802.1Q Tagging</a></li>
<li><a href="#org2677f55">1.2.6. Voice VLAN Tagging</a></li>
<li><a href="#org27c0890">1.2.7. Void Vlan Verification Example</a></li>
</ul>
</li>
<li><a href="#org1714305">1.3. VLAN Configuration</a>
<ul>
<li><a href="#orgae7a450">1.3.1. VLAN Ranges on Catalyst Switches</a></li>
<li><a href="#orge3617d1">1.3.2. VLAN Creation Commands</a></li>
<li><a href="#org03cd2a4">1.3.3. VLAN Port Assignment Commands</a></li>
<li><a href="#orgfc08189">1.3.4. Data and Voice VLANs</a></li>
<li><a href="#org8e9871e">1.3.5. Verify VLAN Information</a></li>
<li><a href="#org003cb4a">1.3.6. Change VLAN Port Membership</a></li>
<li><a href="#orgaf6381a">1.3.7. Delete VLANs</a></li>
</ul>
</li>
<li><a href="#org742e9cf">1.4. VLAN Trunks</a>
<ul>
<li><a href="#org5f046a3">1.4.1. Trunk configuration commands</a></li>
<li><a href="#orgabd2a52">1.4.2. Verify Trunk Configuration</a></li>
<li><a href="#org843956f">1.4.3. Reset the Trunk to the Default State</a></li>
</ul>
</li>
<li><a href="#orgcb0c0b0">1.5. Dynamic Trunking Protocol</a>
<ul>
<li><a href="#orgb0165bb">1.5.1. Introduction to DTP</a></li>
<li><a href="#org33dbd39">1.5.2. Negotiated Interface Modes</a></li>
<li><a href="#org3064740">1.5.3. Verify DTP Mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2ebf412">2. Notes During Class</a>
<ul>
<li><a href="#org3c3f96d">2.1. [3.0] Overview of a VLAN</a>
<ul>
<li><a href="#org9e6bb2c">2.1.1. LAN</a></li>
<li><a href="#orgcde8a09">2.1.2. VLAN</a></li>
</ul>
</li>
<li><a href="#org6293b71">2.2. Types of VLAN</a></li>
<li><a href="#org239b4e8">2.3. [3.2] VLANs in a multi switched environment</a></li>
<li><a href="#orge3df273">2.4. VLAN Identification with Tag</a>
<ul>
<li><a href="#orgca4b2e2">2.4.1. Basics</a></li>
</ul>
</li>
<li><a href="#orgaec7a65">2.5. VLAN in multiple switch environment</a>
<ul>
<li><a href="#org9e0f19d">2.5.1. VoIP VLAN</a></li>
<li><a href="#org56039dc">2.5.2. [3.3] VLAN Configuration</a></li>
<li><a href="#org50b3b65">2.5.3. Changing vlan port membership</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org311c4d4">3. demo notes</a>
<ul>
<li><a href="#orgee4d897">3.1. STEPS</a></li>
<li><a href="#org4d23d68">3.2. Dynamic trunking protocol</a></li>
<li><a href="#orgb60b7ab">3.3. DTP</a></li>
<li><a href="#org81c5c47">3.4. switch port modes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org57c8aed" class="outline-2">
<h2 id="org57c8aed"><span class="section-number-2">1.</span> VLANs (Week 2)</h2>
<div class="outline-text-2" id="text-1">
<p>
Are created at the Layer 2 to reduce or eliminate broadcast
traffic. VLANs are how you break up your network into smaller networks
so that the devices and people within a single VLAN are communicating
with each other and not having tof manage traffic from other networks.jj
</p>
</div>

<div id="outline-container-org84d8656" class="outline-3">
<h3 id="org84d8656"><span class="section-number-3">1.1.</span> Overview of VLANs</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge6bc627" class="outline-4">
<h4 id="orge6bc627"><span class="section-number-4">1.1.1.</span> VLAN Definitions</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Provide segmentation and organizational flexibility in a switched
network. A group of devices withina VLAN communicates as if each
device was attached to the same cable. VLANs are based on <b>logical</b>
connections instead of physical connections
</p>


<p>
A VLAN creates a logical broadcast domain that can span multiple
physical LAN segments. VLANs improve network performance by separating
large broadcast domains into smaller ones. If a device in one VLAN
sends a broadcast Ethernet frame, all devices in the VLAN receive the
frame, but devices in other VLANs do not.
</p>
</div>
</div>
<div id="outline-container-orgf60c264" class="outline-4">
<h4 id="orgf60c264"><span class="section-number-4">1.1.2.</span> Benefits of a VLAN Design</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Each VLAN in a switched netword corresponds to an IP
network. Therefore, VLAN design must take into consideration the
implementation of hiearchical network addressing scheme. <b>Hierarchical
network addressing</b> means that IP network numbers are applied to
network segments or VLANs in a way that takes the network as a whole
into consideration.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Benefit</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Smaller broadcast domains</td>
<td class="org-left">dividing a network into VLANs reduces the number of devices in the broadcase domain</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Improved security</td>
<td class="org-left">only used in the same vlan can communicate together</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">access control lists can be provided to restrict the traffic between VLANs</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Improved IT efficiency</td>
<td class="org-left">VLANs simplify network management because users with similar network requirements can be configured on the same VLAN</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">VLANs can be named</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Reduced cost</td>
<td class="org-left">reduces the cost for expensive network upgrades</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">better performance</td>
<td class="org-left">smaller broadcast domains reduce unnecessary traffic on the network and improve performance</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">simpler project and application management</td>
<td class="org-left">VLANs aggregate users and network devices to support business or geographic requirements</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">having seperate functions makes managing a project or working with a specialized application easire; an example of such an application is an e-learning development platform for faculty]</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org88139b3" class="outline-4">
<h4 id="org88139b3"><span class="section-number-4">1.1.3.</span> Types of VLANs</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="orgaec857c"></a>Default VLAN<br />
<div class="outline-text-5" id="text-1-1-3-1">
<p>
is the VLAN 1 on a cisco switch.
</p>


<p>
<i>NOTE</i>: All port are assigned to VLAN 1 by default. The native VLAN and
management VLAN is VLAN 1. Also, VLAN 1 cannot be renamed or deleted.
</p>


<p>
The command <code>show vlan brief</code> outputs the vlans on a switch and the
ports assigned to them.
</p>
</div>
</li>
<li><a id="org2e4d746"></a>Data VLAN<br />
<div class="outline-text-5" id="text-1-1-3-2">
<p>
are VLANs configured to seperate user-generated traffic. Referred to
as <b>user VLANs</b> because they seperate the network into groups of users
or devices.
</p>

<p>
<i>NOTE</i>: voice and netowrk management traffic should not be permitted
on data VLANs
</p>
</div>
</li>

<li><a id="orgcbca4b0"></a>Native VLAN<br />
<div class="outline-text-5" id="text-1-1-3-3">
<p>
User traffic from a  VLAN must be tagged with its VLAN ID when it is
sent to another switch. Trunk ports are used between switches to
support the transmission of tagged traffic. Specifically, an <b>802.1Q</b>
trunk port inserts a 5 byte tag in the ethernet frame header to
identify the VLAN to which the frame belongs
</p>

<p>
Where untagged frames are assigned to
</p>
</div>
</li>

<li><a id="org88f4627"></a>Management VLAN<br />
<div class="outline-text-5" id="text-1-1-3-4">
<p>
is a data VLAN configured specificalled for network management
traffic, including secure shell (ssh), telnet, HTTPS, HTTP, and
SNMP. By default, VLAN 1 is configured as the management VLAN.
</p>
</div>
</li>
