Lesson-3.org
**** Voice VLAN
A seperate VLAN called a voice VLAN is needed to support Vocie over
IP. VoIP traffic requires:
- assured bandwidth to ensure voice quality
- transmission priority over other types of network traffic
- ability to be routed around congested areas on the network
- delay of less than 150 ms across the network


To meet the requirements, the entire network must be designed to
support VoIP.



** VLANs in a Multi-switched Environment

*** Defining VLAN Trunks
trunks allow all VLAN trffic to propagate between switches. It is a
conduit that allows multiple VLANs between switches and routers. 

*** Network Without VLANs
When a switch receives a broadcast frame on one of its ports, it
forwards the frame out all other ports except the port where the
broadcast was received. Meaning, a faulty device could cause network
congestion to the whole switched network.


*** Network with VLANs




*** Vlan Identification with a Tag
Tagging is the process of putting the VLAN information of an ethernet
frame when passing through a trunk. This is accomplished by the IEEE
802.1Q header


The VLAN tag control information field consists of a Type field,
priority field, a canonical format identifier field, and VLAN ID field

| field                             | description                                                                         |
|-----------------------------------+-------------------------------------------------------------------------------------|
| type                              | tag protocol ID (TPID)                                                              |
|                                   | 2-byte value                                                                        |
|                                   |                                                                                     |
| user priority                     | 3-bit value that supports level or service implementation                           |
|                                   |                                                                                     |
| CFI (canonical format identifier) | 1 bit identifier that enables token ring frames to be carried across ethernet links |
|                                   |                                                                                     |
| VLAN ID (VID)                     | 12-bit VLAN identification number that supports up to 4096 VLAN IDs                 |

After the tag control information fields are inserted, the switch
recalculates the FCS values and inserts the new value into the frame


*** Native VLANs and 802.1Q Tagging
defaults to VLAN 1.

**** Untagged frames on the native VLAN
handled by/forwarded to the native vlan


*** Voice VLAN Tagging
Seperatate VLAN is required. This enables QoS and security policies to
be applied to voice traffice


Cisco IP Phone contains an integrated three-port 10/100 switch. The
ports provide dedicated connections to the following devices:
- Port 1: connects to the switch or other VoIP device
- Port 2: an internal 10/100 interface that carries the IP phone
  traffic
- Port 3: (access port) connects a PC or other device

*** Void Vlan Verification Example
~show interface fa0/18 switchport~ command will output information
about the said switchport


** VLAN Configuration

*** VLAN Ranges on Catalyst Switches
Normal Range
- from 1 to 1005
- used in small- and medium-sized business and enterprise networks
- identified by a VLAN ID between 1 to 1005
- IDs 1002 to 1005 are reserved for legacy network technologies
- configurations are stored int the flash:vlan.dat
- when configured, VLAN trunking protocol (VTP) helps synchronize the
  VLAN database between switches



Extended range
- from 1006 to 4094
- used by service providers
- by a VLAN ID between 1006 and 4094
- configurations are saved, by default, in the running configuration
- the support fewer VLAN features than normal range VLANs
- required VTP transparent mode configuration support extended range VLANs

*** VLAN Creation Commands
#+NAME: vlan creation
#+BEGIN_SRC 
enable
conf terminal
vlan vlan-id
name vlan-name
end
#+END_SRC

*** VLAN Port Assignment Commands
#+NAME: port assignment
#+BEGIN_SRC 
enable
configure terminal
interface range inteface-range-here
switchport mode access
switchport access vlan vlan-id
#+END_SRC

*** Data and Voice VLANs
#+NAME: voice vlan
#+BEGIN_SRC 
enable
configure terminal
int inteface-id
switchport mode access
switchport access vlan vlan-id
mls qos trust cos
switchport voice vlan vlan-15
#+END_SRC

*** Verify VLAN Information
#+NAME: verification commands
#+BEGIN_SRC 
show vlan [brief|vlan-id|vlan-name|summary]
show interfaces fa0/18 switchport

#+END_SRC

*** Change VLAN Port Membership
simply renter the command ~switchport access vlan vlan-id~

*** Delete VLANs
~no vlan vlan-id~ command will delete the selected VLAN. The entire
vlan.dat file can also be deleted through ~delete vlan.dat~.

/NOTE/: before deleting a VLAN, reassign all the member ports


** VLAN Trunks
*** Trunk configuration commands
VLAN trunks are layer 2 links between two switches that carries
traffic for all VLANs.

#+NAME: trunk
#+BEGIN_SRC 
enable
configure terminal
interface interface-id
switchport mode trunk
switchport nonegotiate
switchport trunk native vlan vlan-id
switchport trunk allowed vlan vlan-list
end
#+END_SRC

*** Verify Trunk Configuration
#+NAME: trunk verification
#+BEGIN_SRC 
show interfaces interface-id switchport
show interface trunk
#+END_SRC

*** Reset the Trunk to the Default State
~no switchport trunk allowed vlan~ and ~no switchport trunk native
vlan~ to remove the allowed vlans and remove the native vlan


** Dynamic Trunking Protocol
