Lesson-3.html



<li><a id="orgfe77860"></a>Voide VLAN<br />
<div class="outline-text-5" id="text-1-1-3-5">
<p>
A seperate VLAN called a voice VLAN is needed to support Vocie over
IP. VoIP traffic requires:
</p>
<ul class="org-ul">
<li>assured bandwidth to ensure voice quality</li>
<li>transmission priority over other types of network traffic</li>
<li>ability to be routed around congested areas on the network</li>
<li>delay of less than 150 ms across the network</li>
</ul>


<p>
To meet the requirements, the entire network must be designed to
support VoIP.
</p>
</div>
</li>
</ol>
</div>
</div>



<div id="outline-container-orgb5d40c2" class="outline-3">
<h3 id="orgb5d40c2"><span class="section-number-3">1.2.</span> VLANs in a Multi-switched Environment</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org8b5b274" class="outline-4">
<h4 id="org8b5b274"><span class="section-number-4">1.2.1.</span> Defining VLAN Trunks</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
trunks allow all VLAN trffic to propagate between switches. It is a
conduit that allows multiple VLANs between switches and routers. 
</p>
</div>
</div>

<div id="outline-container-orgd2f62b8" class="outline-4">
<h4 id="orgd2f62b8"><span class="section-number-4">1.2.2.</span> Network Without VLANs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
When a switch receives a broadcast frame on one of its ports, it
forwards the frame out all other ports except the port where the
broadcast was received. Meaning, a faulty device could cause network
congestion to the whole switched network.
</p>
</div>
</div>


<div id="outline-container-org4f11e31" class="outline-4">
<h4 id="org4f11e31"><span class="section-number-4">1.2.3.</span> Network with VLANs</h4>
</div>




<div id="outline-container-orgc1eee00" class="outline-4">
<h4 id="orgc1eee00"><span class="section-number-4">1.2.4.</span> Vlan Identification with a Tag</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Tagging is the process of putting the VLAN information of an ethernet
frame when passing through a trunk. This is accomplished by the IEEE
802.1Q header
</p>


<p>
The VLAN tag control information field consists of a Type field,
priority field, a canonical format identifier field, and VLAN ID field
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">field</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">type</td>
<td class="org-left">tag protocol ID (TPID)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">2-byte value</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">user priority</td>
<td class="org-left">3-bit value that supports level or service implementation</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CFI (canonical format identifier)</td>
<td class="org-left">1 bit identifier that enables token ring frames to be carried across ethernet links</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VLAN ID (VID)</td>
<td class="org-left">12-bit VLAN identification number that supports up to 4096 VLAN IDs</td>
</tr>
</tbody>
</table>

<p>
After the tag control information fields are inserted, the switch
recalculates the FCS values and inserts the new value into the frame
</p>
</div>
</div>


<div id="outline-container-orge440074" class="outline-4">
<h4 id="orge440074"><span class="section-number-4">1.2.5.</span> Native VLANs and 802.1Q Tagging</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
defaults to VLAN 1.
</p>
</div>

<ol class="org-ol">
<li><a id="org9ecbbf7"></a>Untagged frames on the native VLAN<br />
<div class="outline-text-5" id="text-1-2-5-1">
<p>
handled by/forwarded to the native vlan
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-org2677f55" class="outline-4">
<h4 id="org2677f55"><span class="section-number-4">1.2.6.</span> Voice VLAN Tagging</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Seperatate VLAN is required. This enables QoS and security policies to
be applied to voice traffice
</p>


<p>
Cisco IP Phone contains an integrated three-port 10/100 switch. The
ports provide dedicated connections to the following devices:
</p>
<ul class="org-ul">
<li>Port 1: connects to the switch or other VoIP device</li>
<li>Port 2: an internal 10/100 interface that carries the IP phone
traffic</li>
<li>Port 3: (access port) connects a PC or other device</li>
</ul>
</div>
</div>

<div id="outline-container-org27c0890" class="outline-4">
<h4 id="org27c0890"><span class="section-number-4">1.2.7.</span> Void Vlan Verification Example</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
<code>show interface fa0/18 switchport</code> command will output information
about the said switchport
</p>
</div>
</div>
</div>


<div id="outline-container-org1714305" class="outline-3">
<h3 id="org1714305"><span class="section-number-3">1.3.</span> VLAN Configuration</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgae7a450" class="outline-4">
<h4 id="orgae7a450"><span class="section-number-4">1.3.1.</span> VLAN Ranges on Catalyst Switches</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Normal Range
</p>
<ul class="org-ul">
<li>from 1 to 1005</li>
<li>used in small- and medium-sized business and enterprise networks</li>
<li>identified by a VLAN ID between 1 to 1005</li>
<li>IDs 1002 to 1005 are reserved for legacy network technologies</li>
<li>configurations are stored int the flash:vlan.dat</li>
<li>when configured, VLAN trunking protocol (VTP) helps synchronize the
VLAN database between switches</li>
</ul>



<p>
Extended range
</p>
<ul class="org-ul">
<li>from 1006 to 4094</li>
<li>used by service providers</li>
<li>by a VLAN ID between 1006 and 4094</li>
<li>configurations are saved, by default, in the running configuration</li>
<li>the support fewer VLAN features than normal range VLANs</li>
<li>required VTP transparent mode configuration support extended range VLANs</li>
</ul>
</div>
</div>

<div id="outline-container-orge3617d1" class="outline-4">
<h4 id="orge3617d1"><span class="section-number-4">1.3.2.</span> VLAN Creation Commands</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example" id="orgd16e5a6">
enable
conf terminal
vlan vlan-id
name vlan-name
end
</pre>
</div>
</div>

<div id="outline-container-org03cd2a4" class="outline-4">
<h4 id="org03cd2a4"><span class="section-number-4">1.3.3.</span> VLAN Port Assignment Commands</h4>
<div class="outline-text-4" id="text-1-3-3">
<pre class="example" id="org1629a36">
enable
configure terminal
interface range inteface-range-here
switchport mode access
switchport access vlan vlan-id
</pre>
</div>
</div>

<div id="outline-container-orgfc08189" class="outline-4">
<h4 id="orgfc08189"><span class="section-number-4">1.3.4.</span> Data and Voice VLANs</h4>
<div class="outline-text-4" id="text-1-3-4">
<pre class="example" id="orgf1932ba">
enable
configure terminal
int inteface-id
switchport mode access
switchport access vlan vlan-id
mls qos trust cos
switchport voice vlan vlan-15
</pre>
</div>
</div>

<div id="outline-container-org8e9871e" class="outline-4">
<h4 id="org8e9871e"><span class="section-number-4">1.3.5.</span> Verify VLAN Information</h4>
<div class="outline-text-4" id="text-1-3-5">
<pre class="example" id="orgdfb42f6">
show vlan [brief|vlan-id|vlan-name|summary]
show interfaces fa0/18 switchport

</pre>
</div>
</div>

<div id="outline-container-org003cb4a" class="outline-4">
<h4 id="org003cb4a"><span class="section-number-4">1.3.6.</span> Change VLAN Port Membership</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
simply renter the command <code>switchport access vlan vlan-id</code>
</p>
</div>
</div>

<div id="outline-container-orgaf6381a" class="outline-4">
<h4 id="orgaf6381a"><span class="section-number-4">1.3.7.</span> Delete VLANs</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
<code>no vlan vlan-id</code> command will delete the selected VLAN. The entire
vlan.dat file can also be deleted through <code>delete vlan.dat</code>.
</p>

<p>
<i>NOTE</i>: before deleting a VLAN, reassign all the member ports
</p>
</div>
</div>
</div>


<div id="outline-container-org742e9cf" class="outline-3">
<h3 id="org742e9cf"><span class="section-number-3">1.4.</span> VLAN Trunks</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org5f046a3" class="outline-4">
<h4 id="org5f046a3"><span class="section-number-4">1.4.1.</span> Trunk configuration commands</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
VLAN trunks are layer 2 links between two switches that carries
traffic for all VLANs.
</p>

<pre class="example" id="org0387434">
enable
configure terminal
interface interface-id
switchport mode trunk
switchport nonegotiate
switchport trunk native vlan vlan-id
switchport trunk allowed vlan vlan-list
end
</pre>
</div>
</div>

<div id="outline-container-orgabd2a52" class="outline-4">
<h4 id="orgabd2a52"><span class="section-number-4">1.4.2.</span> Verify Trunk Configuration</h4>
<div class="outline-text-4" id="text-1-4-2">
<pre class="example" id="orgb3ef5d3">
show interfaces interface-id switchport
show interface trunk
</pre>
</div>
</div>

<div id="outline-container-org843956f" class="outline-4">
<h4 id="org843956f"><span class="section-number-4">1.4.3.</span> Reset the Trunk to the Default State</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
<code>no switchport trunk allowed vlan</code> and <code>no switchport trunk native
vlan</code> to remove the allowed vlans and remove the native vlan
</p>
</div>
</div>
</div>
