Lesson-3.org
*** Introduction to DTP
It is a protocol that allows automatic negotiate trunking with a
neigboring device. It is automatically enabled on 2960 and 3650
Catalyst switches. To enable this mode enter the ~switchport mode dynamic auto~ interface configuration command. 
*** Negotiated Interface Modes
~switchport mode { access | dynamic { auto | desirable } | trunk }~


| option            | description                                                                                                      |
|-------------------+------------------------------------------------------------------------------------------------------------------|
| access            | puts the interface into permanent nontrunking mode and negotiates to convert the link into a nontrunk link       |
|                   | the interface becomes a nontrunk interface regardless of whether the neighboring interface is a trunk interface  |
|                   |                                                                                                                  |
| dynamic auto      | makes the interface able to convert the link into a trunk link                                                   |
|                   | interfaces becomes a trunk if the neighboring interface is set to *trunk or desirable*                           |
|                   |                                                                                                                  |
| dynamic desirable | makes the interface actively attempt to convert the link to a trunk link                                         |
|                   | interface becomes a trunk interface if the neighboring interface is set to trunk, desirable or dynamic auto mode |
|                   |                                                                                                                  |
| trunk             | puts the interface into permanent trunking mode and negotiates to convert the neighboring link into a trunk link |
|                   | the interface becomes a trunk interface even if the neightboring interface is not a trunk interface              |


*** Verify DTP Mode
#+NAME: verify DTP
#+BEGIN_SRC 
show interface fa0/1
#+END_SRC


* Notes During Class

** [3.0] Overview of a VLAN
*** LAN
- Local area network
- connected devices in a small geographical area
- usually are a switch network (switch is sufficient to intermediate
  all)
- problem is usually the *broadcast domain*
  - a switch only has one broadcast domain, all devices connected to
    the switch will receive the b-message
  - messages can be unintentionally sent, violates the concept of
    confidentiality 

*** VLAN
- logical connections with other similar devices
- idea is splitting the switch into parts for segregation (will split
  the broadcast domain)
- *purpose is to virtually split the switch to several LANs*

**** placing devices into various VLANs have the following
- provides segmentation
- organization
- broadcasts, multicasts, and unicasts are isolated
- VLAN have unique range of IP addressing
- smaller broadcast domains
- improves security
  - user groups on the same vlan
- reduces cost
- better performance
- simpler management

** Types of VLAN
- Default VLAN
  - VLAN 1
  - switches have this by default
  - default: native VLAN, VLAN, Management VLAN, cannot be deleted or
    renamed
  - all ports are here by defaultt

#+NAME: vlan show
#+BEGIN_SRC 
Switch# show vlan brief
#+END_SRC

- Data vlan
  - where users data flow through
- Native VLAN
  - free passes
  - used for trunk links

- Management VLAN
  - for SSH and Telnet VTY    
- Voice VLAN
  - when there is an voIP, a voice VLAN is required
  - 

/VLANS will be changed as best practive/

/one [END] device can only have one vlan/

A cisco (catalysy) switch can have 4096 vlans

** [3.2] VLANs in a multi switched environment
- VLAN trunk
  - allows vlan of the same number (vlan 10) through other switches
  - will allow devices can have the same broadcast domain even if long
    distance
  - Trunk link: allows links between switches' VLANs
  - *a point to point link* between two switches, switch or another
    networking device
  - allows more than one vlan
  - extend vlan over the whole network
  - 802.1Q trunking
  - Vlans cannot communicate without a router (inter VLAN)

    
** VLAN Identification with Tag
- *IEEE 802.1Q*
- used to identify which member of vlan is the frame
*** Basics
- if a message will do throught a trunk, 802.1Q(Tagging) is needed
- if native vlan, then tagging is not required
- both ends of the trunk link must be configured with the same native VLAN
** VLAN in multiple switch environment
*** VoIP VLAN
- middle man, will still work on the end device at the end...
~show interfaces fa0/18 switchport~

- modes of VoiP
- auto
- dynamic auto
- dynamic desirable
- access
- trunk
*** [3.3] VLAN Configuration
- stored in a vlan.dat in flash
- vlan-id can be form vlan 2-1000

  *default mode:* dynamic auto
  *needs to be changed to access*
#+NAME: VLAN CONFIG
#+BEGIN_SRC 
# show vlan brief
# config terminal
(config)# vlan vlan-id
(config-vlan)# name vlan-name
(config-vlan)# exit
---- ililipat yung port to the newly created vlan ----
(config)# interface interface-id
(config-if)# switchport mode access
(config-if)# switchport access vlan vlan-id
#+END_SRC

#+NAME: VLAN CONFIG
#+BEGIN_SRC 
# show vlan brief
# config terminal
(config)# vlan vlan-id
(config-vlan)# name vlan-name
(config-vlan)# exit
---- ililipat yung port to the newly created vlan ----
(config)# interface interface-id
(config-if)# switchport mode access
(config-if)# switchport access vlan vlan-id
(config-if)# mls qos trust cos
(config-if)# switchport voice vlan 150
#+END_SRC
