Lesson-3.html


<div id="outline-container-orgcb0c0b0" class="outline-3">
<h3 id="orgcb0c0b0"><span class="section-number-3">1.5.</span> Dynamic Trunking Protocol</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgb0165bb" class="outline-4">
<h4 id="orgb0165bb"><span class="section-number-4">1.5.1.</span> Introduction to DTP</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
It is a protocol that allows automatic negotiate trunking with a
neigboring device. It is automatically enabled on 2960 and 3650
Catalyst switches. To enable this mode enter the <code>switchport mode dynamic auto</code> interface configuration command. 
</p>
</div>
</div>
<div id="outline-container-org33dbd39" class="outline-4">
<h4 id="org33dbd39"><span class="section-number-4">1.5.2.</span> Negotiated Interface Modes</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
<code>switchport mode { access | dynamic { auto | desirable } | trunk }</code>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">option</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">access</td>
<td class="org-left">puts the interface into permanent nontrunking mode and negotiates to convert the link into a nontrunk link</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the interface becomes a nontrunk interface regardless of whether the neighboring interface is a trunk interface</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dynamic auto</td>
<td class="org-left">makes the interface able to convert the link into a trunk link</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">interfaces becomes a trunk if the neighboring interface is set to <b>trunk or desirable</b></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dynamic desirable</td>
<td class="org-left">makes the interface actively attempt to convert the link to a trunk link</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">interface becomes a trunk interface if the neighboring interface is set to trunk, desirable or dynamic auto mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">trunk</td>
<td class="org-left">puts the interface into permanent trunking mode and negotiates to convert the neighboring link into a trunk link</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the interface becomes a trunk interface even if the neightboring interface is not a trunk interface</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3064740" class="outline-4">
<h4 id="org3064740"><span class="section-number-4">1.5.3.</span> Verify DTP Mode</h4>
<div class="outline-text-4" id="text-1-5-3">
<pre class="example" id="orgd8ee4ac">
show interface fa0/1
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2ebf412" class="outline-2">
<h2 id="org2ebf412"><span class="section-number-2">2.</span> Notes During Class</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3c3f96d" class="outline-3">
<h3 id="org3c3f96d"><span class="section-number-3">2.1.</span> [3.0] Overview of a VLAN</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org9e6bb2c" class="outline-4">
<h4 id="org9e6bb2c"><span class="section-number-4">2.1.1.</span> LAN</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Local area network</li>
<li>connected devices in a small geographical area</li>
<li>usually are a switch network (switch is sufficient to intermediate
all)</li>
<li>problem is usually the <b>broadcast domain</b>
<ul class="org-ul">
<li>a switch only has one broadcast domain, all devices connected to
the switch will receive the b-message</li>
<li>messages can be unintentionally sent, violates the concept of
confidentiality</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcde8a09" class="outline-4">
<h4 id="orgcde8a09"><span class="section-number-4">2.1.2.</span> VLAN</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>logical connections with other similar devices</li>
<li>idea is splitting the switch into parts for segregation (will split
the broadcast domain)</li>
<li><b>purpose is to virtually split the switch to several LANs</b></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orge4520dc"></a>placing devices into various VLANs have the following<br />
<div class="outline-text-5" id="text-2-1-2-1">
<ul class="org-ul">
<li>provides segmentation</li>
<li>organization</li>
<li>broadcasts, multicasts, and unicasts are isolated</li>
<li>VLAN have unique range of IP addressing</li>
<li>smaller broadcast domains</li>
<li>improves security
<ul class="org-ul">
<li>user groups on the same vlan</li>
</ul></li>
<li>reduces cost</li>
<li>better performance</li>
<li>simpler management</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org6293b71" class="outline-3">
<h3 id="org6293b71"><span class="section-number-3">2.2.</span> Types of VLAN</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Default VLAN
<ul class="org-ul">
<li>VLAN 1</li>
<li>switches have this by default</li>
<li>default: native VLAN, VLAN, Management VLAN, cannot be deleted or
renamed</li>
<li>all ports are here by defaultt</li>
</ul></li>
</ul>

<pre class="example" id="orgecad53d">
Switch# show vlan brief
</pre>

<ul class="org-ul">
<li>Data vlan
<ul class="org-ul">
<li>where users data flow through</li>
</ul></li>
<li>Native VLAN
<ul class="org-ul">
<li>free passes</li>
<li>used for trunk links</li>
</ul></li>

<li>Management VLAN
<ul class="org-ul">
<li>for SSH and Telnet VTY</li>
</ul></li>
<li>Voice VLAN
<ul class="org-ul">
<li>when there is an voIP, a voice VLAN is required</li>
<li></li>
</ul></li>
</ul>

<p>
<i>VLANS will be changed as best practive</i>
</p>

<p>
<i>one [END] device can only have one vlan</i>
</p>

<p>
A cisco (catalysy) switch can have 4096 vlans
</p>
</div>
</div>

<div id="outline-container-org239b4e8" class="outline-3">
<h3 id="org239b4e8"><span class="section-number-3">2.3.</span> [3.2] VLANs in a multi switched environment</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>VLAN trunk
<ul class="org-ul">
<li>allows vlan of the same number (vlan 10) through other switches</li>
<li>will allow devices can have the same broadcast domain even if long
distance</li>
<li>Trunk link: allows links between switches' VLANs</li>
<li><b>a point to point link</b> between two switches, switch or another
networking device</li>
<li>allows more than one vlan</li>
<li>extend vlan over the whole network</li>
<li>802.1Q trunking</li>
<li>Vlans cannot communicate without a router (inter VLAN)</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orge3df273" class="outline-3">
<h3 id="orge3df273"><span class="section-number-3">2.4.</span> VLAN Identification with Tag</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>IEEE 802.1Q</b></li>
<li>used to identify which member of vlan is the frame</li>
</ul>
</div>
<div id="outline-container-orgca4b2e2" class="outline-4">
<h4 id="orgca4b2e2"><span class="section-number-4">2.4.1.</span> Basics</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>if a message will do throught a trunk, 802.1Q(Tagging) is needed</li>
<li>if native vlan, then tagging is not required</li>
<li>both ends of the trunk link must be configured with the same native VLAN</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaec7a65" class="outline-3">
<h3 id="orgaec7a65"><span class="section-number-3">2.5.</span> VLAN in multiple switch environment</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org9e0f19d" class="outline-4">
<h4 id="org9e0f19d"><span class="section-number-4">2.5.1.</span> VoIP VLAN</h4>
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li>middle man, will still work on the end device at the end&#x2026;</li>
</ul>
<p>
<code>show interfaces fa0/18 switchport</code>
</p>

<ul class="org-ul">
<li>modes of VoiP</li>
<li>auto</li>
<li>dynamic auto</li>
<li>dynamic desirable</li>
<li>access</li>
<li>trunk</li>
</ul>
</div>
</div>
<div id="outline-container-org56039dc" class="outline-4">
<h4 id="org56039dc"><span class="section-number-4">2.5.2.</span> [3.3] VLAN Configuration</h4>
<div class="outline-text-4" id="text-2-5-2">
<ul class="org-ul">
<li>stored in a vlan.dat in flash</li>
<li><p>
vlan-id can be form vlan 2-1000
</p>

<p>
<b>default mode:</b> dynamic auto
<b>needs to be changed to access</b>
</p></li>
</ul>
<pre class="example" id="org04e76b5">
# show vlan brief
# config terminal
(config)# vlan vlan-id
(config-vlan)# name vlan-name
(config-vlan)# exit
---- ililipat yung port to the newly created vlan ----
(config)# interface interface-id
(config-if)# switchport mode access
(config-if)# switchport access vlan vlan-id
</pre>

<pre class="example" id="org4fe065a">
# show vlan brief
# config terminal
(config)# vlan vlan-id
(config-vlan)# name vlan-name
(config-vlan)# exit
---- ililipat yung port to the newly created vlan ----
(config)# interface interface-id
(config-if)# switchport mode access
(config-if)# switchport access vlan vlan-id
(config-if)# mls qos trust cos
(config-if)# switchport voice vlan 150
</pre>
</div>
</div>
