Lesson-3.org
*** Changing vlan port membership
> ~no switchport access vlan~ -> goes back to VLAN 1
> ~no vlan~ -> deletes vlan (but will persist on memory)
> ~delete flash:vlan.dat~ -> deletes the database file

* demo notes
#+NAME: demo
#+BEGIN_SRC 
enable
conf t
hostname swname
show vlan br -- will probably show vlan 1
do show flash -- wala pa vlan database

---- vlan creation
vlan 10
name FACULTY
vlan 20
name STUDENT
vlan 30
name GUEST

do show vlan br -- will show new vlans but with no ports

-- setting ports

int range fa0/1-10
switchport mode access
switchport access vlan 10

int range fa0/11-15
switchport mode access
switchport access vlan 10

int range fa0/16-20
switchport mode access
switchport access vlan 10

do show vlan br -- will now show created vlans with ports

#+END_SRC
** STEPS
1. create the vlans
2. configure the ports to specify the vlans
3. TRUNK: 

#+NAME: trunk link
#+BEGIN_SRC
interface interface-id
switchport mode trunk
switchport nonegotiate# para di magusap yung dalawng switch
switchport trunk native vlan vlan-id (1)
switchport trunk allowed vlan 10,20,30,40,99,100
end
verify show interfaces fa0/1 switchport
#+END_SRC


*TCI sa headers ay kung saang vlan pupunta/galing*
** Dynamic trunking protocol
- IN NETWORKING: dynamic == automatic
- switches automatically make trunk links
- allows two switches to build a common configuration
** DTP
- proprietary Cisco protocol
- default on in catalyst 2960 and 2950 switches
- dynamic trunk protocol
** switch port modes

access
- permanent access mode
- convert the neighboring link into an access link

dynamic auto
- becomes trunk or desirable mode
  
dynamic desirable
- actively seeks to become trunk by negotiating with other auto or
  desirable interfaces

trunk
- allows VLAN traffic to propogate between switches
  
