Lesson-3.html
<div id="outline-container-org50b3b65" class="outline-4">
<h4 id="org50b3b65"><span class="section-number-4">2.5.3.</span> Changing vlan port membership</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
&gt; <code>no switchport access vlan</code> -&gt; goes back to VLAN 1
&gt; <code>no vlan</code> -&gt; deletes vlan (but will persist on memory)
&gt; <code>delete flash:vlan.dat</code> -&gt; deletes the database file
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org311c4d4" class="outline-2">
<h2 id="org311c4d4"><span class="section-number-2">3.</span> demo notes</h2>
<div class="outline-text-2" id="text-3">
<pre class="example" id="org53145f7">
enable
conf t
hostname swname
show vlan br -- will probably show vlan 1
do show flash -- wala pa vlan database

---- vlan creation
vlan 10
name FACULTY
vlan 20
name STUDENT
vlan 30
name GUEST

do show vlan br -- will show new vlans but with no ports

-- setting ports

int range fa0/1-10
switchport mode access
switchport access vlan 10

int range fa0/11-15
switchport mode access
switchport access vlan 10

int range fa0/16-20
switchport mode access
switchport access vlan 10

do show vlan br -- will now show created vlans with ports

</pre>
</div>
<div id="outline-container-orgee4d897" class="outline-3">
<h3 id="orgee4d897"><span class="section-number-3">3.1.</span> STEPS</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>create the vlans</li>
<li>configure the ports to specify the vlans</li>
<li>TRUNK:</li>
</ol>

<pre class="example" id="orgdf700a4">
interface interface-id
switchport mode trunk
switchport nonegotiate# para di magusap yung dalawng switch
switchport trunk native vlan vlan-id (1)
switchport trunk allowed vlan 10,20,30,40,99,100
end
verify show interfaces fa0/1 switchport
</pre>


<p>
<b>TCI sa headers ay kung saang vlan pupunta/galing</b>
</p>
</div>
</div>
<div id="outline-container-org4d23d68" class="outline-3">
<h3 id="org4d23d68"><span class="section-number-3">3.2.</span> Dynamic trunking protocol</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>IN NETWORKING: dynamic == automatic</li>
<li>switches automatically make trunk links</li>
<li>allows two switches to build a common configuration</li>
</ul>
</div>
</div>
<div id="outline-container-orgb60b7ab" class="outline-3">
<h3 id="orgb60b7ab"><span class="section-number-3">3.3.</span> DTP</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>proprietary Cisco protocol</li>
<li>default on in catalyst 2960 and 2950 switches</li>
<li>dynamic trunk protocol</li>
</ul>
</div>
</div>
<div id="outline-container-org81c5c47" class="outline-3">
<h3 id="org81c5c47"><span class="section-number-3">3.4.</span> switch port modes</h3>
<div class="outline-text-3" id="text-3-4">
<p>
access
</p>
<ul class="org-ul">
<li>permanent access mode</li>
<li>convert the neighboring link into an access link</li>
</ul>

<p>
dynamic auto
</p>
<ul class="org-ul">
<li>becomes trunk or desirable mode</li>
</ul>

<p>
dynamic desirable
</p>
<ul class="org-ul">
<li>actively seeks to become trunk by negotiating with other auto or
desirable interfaces</li>
</ul>

<p>
trunk
</p>
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Emmanuel Parreno</p>
<p class="date">Created: 2025-02-10 Mon 17:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
